{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"layers": [{"config": {"strides": [1, 1], "bias_regularizer": null, "activation": "relu", "name": "conv2d_1", "batch_input_shape": [null, 28, 28, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "dtype": "float32", "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 30, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_size": [5, 5], "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 128, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "name": "dense_2", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 50, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "name": "dense_3", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "units": 10, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}], "name": "sequential_1"}, "class_name": "Sequential"}